capacity_tests/jmeter_broken_cert_tls_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="RADIUS Weighted Test">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">800</intProp>
        <intProp name="ThreadGroup.ramp_time">20</intProp>
	<longProp name="ThreadGroup.duration">150</longProp>
	<boolProp name="ThreadGroup.scheduler">true</boolProp>
	<elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
    	  <stringProp name="LoopController.loops">-1</stringProp> <boolProp name="LoopController.continue_forever">false</boolProp>
	</elementProp>
      </ThreadGroup>
      <hashTree>
        
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="100% PEAP">
          <intProp name="ThroughputController.style">1</intProp>
          <stringProp name="ThroughputController.percentThroughput">100.0</stringProp>
        </ThroughputController>
        <hashTree>
          <SystemSampler guiclass="SystemSamplerGui" testclass="SystemSampler" testname="PEAP Success">
            <stringProp name="SystemSampler.command">./run_tls_broken.sh</stringProp>
            <stringProp name="SystemSampler.directory">/capacity_tests/scripts</stringProp>
            <elementProp name="SystemSampler.arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp>
            <elementProp name="SystemSampler.environment" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp>
          </SystemSampler>
          <hashTree/>
        </hashTree>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>